## Step 1 : A) Examine the dataset

##### Load the data and understand its structure. Identify each column, its data type, and split data accoording to its prefix (C, S, Q, target). The dataset includes various data types such as numerical, categorical, and boolean, so Iâ€™ll need to handle each type appropriately.

In [30]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OrdinalEncoder

In [32]:
inputs = pd.read_csv('../data/raw/inputs.csv', sep=';')
inputs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85529 entries, 0 to 85528
Columns: 109 entries, ID to Q75
dtypes: float64(40), int64(18), object(51)
memory usage: 71.1+ MB

In [33]:
households_columns = ["ID", "COD_INSEE", "COD_IRIS"]
clients_columns = ["ID"] + [f"C{i}" for i in range(1, 20)]
site_columns = ["ID"] + [f"S{i}" for i in range(1, 13)]
questions_columns = ["ID"] + [f"Q{i}" for i in range(1, 76)]

In [34]:
inputs[households_columns].to_csv('../data/raw/households.csv', index=False)
inputs[clients_columns].to_csv('../data/raw/clients.csv', index=False)
inputs[site_columns].to_csv('../data/raw/site.csv', index=False)
inputs[questions_columns].to_csv('../data/raw/questions.csv', index=False)

### Clients data

In [35]:
clients = pd.read_csv('../data/raw/clients.csv')
clients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85529 entries, 0 to 85528
Data columns (total 20 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      85529 non-null  int64
 1   C1      85529 non-null  object
 2   C2      85529 non-null  object
 3   C3      85529 non-null  object
 4   C4      85529 non-null  object
 5   C5      85529 non-null  int64
 6   C6      85529 non-null  int64
 7   C7      85529 non-null  int64
 8   C8      85529 non-null  object
 9   C9      85529 non-null  object
 10  C10     85529 non-null  int64
 11  C11     85529 non-null  int64
 12  C12     85529 non-null  object
 13  C13     85529 non-null  object
 14  C14     85529 non-null  object
 15  C15     85529 non-null  int64
 16  C16     85529 non-null  int64
 17  C17     85529 non-null  int64
 18  C18     85529 non-null  int64
 19  C19     85529 non-null  int64
dtypes: int64(11), object(9)
memory usage: 13.1+ MB

In [15]:
clients.head(10)

,ID,C1,C2,C3,C4,C5,C6,C7,C8,C9,C10,C11,C12,C13,C14,C15,C16,C17,C18,C19
0,0,EA,RA,C,IB,0,0,0,YA,RA,8,2286,OB,RC,OB,2,214,212,16,7
1,1,EA,RA,C,IA,0,0,0,YB,RA,166,2220,OB,RC,OB,3,511,414,15,19
2,2,EA,RC,B,IA,0,0,0,YB,RA,17,2265,OC,R7,OA,4,407,405,17,8
3,3,EA,RA,C,IB,0,0,0,YB,RA,16,2250,OA,RC,OB,3,712,410,16,12
4,4,EA,RA,B,IB,0,0,0,YA,RA,23,2305,OB,RC,OA,1,206,204,17,4
5,5,EA,RA,B,IB,0,0,0,YB,RA,112,2260,OB,RC,OA,2,417,415,15,13
6,6,EA,RA,B,IB,0,1,0,YB,RA,14,2230,OA,RC,OB,2,609,407,16,12
7,7,EA,RA,C,IB,0,0,0,YB,RA,42,2238,OB,RC,OA,5,108,106,16,4
8,8,EA,RA,C,IB,0,0,0,YB,RA,10,2208,OB,RC,OB,4,510,413,15,12
9,9,EA,RA,C,IB,0,0,0,YB,RA,24,2297,OB,RC,OB,2,111,109,17,4

In [22]:
clients.isna().sum()

ID     0
C1     0
C2     0
C3     0
C4     0
C5     0
C6     0
C7     0
C8     0
C9     0
C10    0
C11    0
C12    0
C13    0
C14    0
C15    0
C16    0
C17    0
C18    0
C19    0
dtype: int64

The client data have no missing values (no NaN values).

In [36]:
objects = clients.select_dtypes(include=['object']).columns.to_list()
ints = clients.select_dtypes(include=['int64']).columns.to_list()
print("object columns are :", objects)
print("ints columns are :", ints)

object columns are : ['C1', 'C2', 'C3', 'C4', 'C8', 'C9', 'C12', 'C13', 'C14']
ints columns are : ['ID', 'C5', 'C6', 'C7', 'C10', 'C11', 'C15', 'C16', 'C17', 'C18', 'C19']

In [37]:
for column in objects:
    print(f"Unique values in column '{column}':")
    print(clients[column].unique())
    print("-" * 40)

Unique values in column 'C1':
['EA']
----------------------------------------
Unique values in column 'C2':
['RA' 'RC' 'RB' 'R7']
----------------------------------------
Unique values in column 'C3':
['C' 'B' 'A' 'E' 'D' 'F' 'G' 'I' 'H']
----------------------------------------
Unique values in column 'C4':
['IB' 'IA']
----------------------------------------
Unique values in column 'C8':
['YA' 'YB']
----------------------------------------
Unique values in column 'C9':
['RA' 'RB']
----------------------------------------
Unique values in column 'C12':
['OB' 'OC' 'OA' 'O7']
----------------------------------------
Unique values in column 'C13':
['RC' 'R7' 'RD' 'RA' 'RB']
----------------------------------------
Unique values in column 'C14':
['OB' 'OA']
----------------------------------------

We drop C1 since it is a constant. For C2, C12 and C13, we can use one-hot encoding. For C3, we can use ordinal encoding. For the rest of the columns, we can use label encoding.

In [38]:
clients.drop('C1', axis=1, inplace=True)
clients = pd.get_dummies(clients, columns=['C2', 'C12', 'C13'], drop_first=False)

label_cols = ['C4', 'C8', 'C9', 'C14']
label_encoder = LabelEncoder()
for col in label_cols:
    clients[col] = label_encoder.fit_transform(clients[col])

ordinal_encoder = OrdinalEncoder()
clients['C3'] = ordinal_encoder.fit_transform(clients[['C3']])

In [ ]:
clients[clients.select_dtypes(include=['float64', 'bool']).columns.to_list()] = clients[clients.select_dtypes(include=['float64', 'bool']).columns.to_list()].astype('int64')
clients[[column for column in clients.columns if column not in ints]].head(10)

In [46]:
for column in ints[1:]:
    print(f"Unique values in column '{column}':")
    print(clients[column].unique())
    print("-" * 40)

Unique values in column 'C5':
[0 1]
----------------------------------------
Unique values in column 'C6':
[0 1]
----------------------------------------
Unique values in column 'C7':
[0 1]
----------------------------------------
Unique values in column 'C10':
[   8  166   17   16   23  112   14   42   10   24   30   76   52   33
   38  128   22   13   18  116   39    5   37   41    7   93   96  176
   31   12   28   46   25    2   34    3   11    6    4    1   36   66
   56   64   86    9  104  216  101   40   26   32   35   29   43  115
   51   15   19   79   21   48   27  109   20  316  236   97   44  106
  250   95   53   69   45   47   49  126   63   73   61   87   62   81
   65   54   68  206   57   83  140   80  147    0  110  146  137  167
   88   94   50  261   59  196   78   60  111  516  186   71  231  136
  227  120   91  156  190   58  193  616   67  706  232  131  401   75
  105  134  168  229   74  328  102  262  266  149  132   84  125  164
  222  243  416  201  114   55   82  122  160  144  139  100  204  191
  151  138  716   85  143  224  711  256  226  121  170  145  118  117
  264  220  180  806  133  129  189  288   90   89  113   77   92  141
  466  171  162  123  127   70  200  107  705  366  174  130  108  135
  197  181   98  303  211  241  103  215  161  218  142  119  184  225
   72  163  304 1004  169  150  124 2016  178  281  214  233  474  159
  280  153  157  205  230  155  257  187  246  234  154  398  389  239
  407  148  382  450  199  286  331  202  195  238  175   99  284  207
  396  221  356 1997  210  192  255  188  182  251  276  376  265  194
  816  566  327  292  268  152  172  916  332  296  436  223  217  165
  499  263  374  324  198  283  306  253  300  326  434  345  446  317
  371  248  179  451  336  320 1016  183  203  518  308  337  173  368
  400  520  235  244  247  269  333  351  391  456  287  405]
----------------------------------------
Unique values in column 'C11':
[2286 2220 2265 2250 2305 2260 2230 2238 2208 2297 2275 2200 2285 2180
 2326 2190 2070 2270 2336 2240 2218 2236 2280 2170 2317 2264 2050 2309
 2205 2150 2302 2261 2160 2306 2291 2245 2301 2310 2262 2000 2268 2315
 2328 2210 2284 2290 2296 2282 2120 2229 2287 2263 2318 2080 2149 2295
 2254 2215 2175 2234 2293 2100 2232 2303 2300 2216 2313 2185 2211 2241
 2277 2162 2267 2307 2130 2256 2255 2283 2308 2226 2288 2266 2128 2298
 2279 2278 2294 2225 2272 2316 2276 2186 2332 2235 2173 2249 2324 2269
 2320 2207 2319 2314 2257 2292 2252 2242 2289 2273 2239 2140 2110 2274
 2223 2258 2251 2323 2178 2172 2248 2187 2299 2243 2233 2271 2222 2020
 2327 2304 2237 2227 2214 2206 2333 2330 2312 2194 2244 2325 2189 2311
 2181 2322 2193 2196 2030 2224 2191 2253 2164 2202 2246 2329 2111 2125
 2228 2182 2247 2203 2201 2281 2145 2197 2174 2212 2165 2199 2213 2335
 2221 2259 2321 2192 2219 2231 2147 1900 2121 2339 2195 2134 1750 2158
 2056 2331 2155 2334 2049 2338 1990 2177 2146 1950 2176 2143 2090 2152
 2004 2217 2166 2159 2204 2209 1850 2340 1980 2184 2179 2188 2122 2167
 2142 2198 2171 2161 2060 2168 2086 2337 2156 2101 2153 2135 2163 2116
 2093 2053 2124 2138 2085 2151 2154 2183 2115 2112 2136 2148 2169 2075
 2067 2065 1920 2052 1870 2066 2131 2077 2157 1982 2082 2062 2144 2132
 1970 2038 2045 2010 2040 2141 2068 2055 2095 2133 2098 2123 2129 1810
 2107 1365 2117 2097 2035 2114 1854 2078 2025 2118 2103 1800 2137 1901
 2096 1930 1350 2105 2109 2104 2126 2119 2106 2083 1890 2127 2034 1985
 2007    0 1975 2084 2108 2091 2102 2341 2054 1933 2072 2087 2094 2063
 2139 2113 2079 2081 2092 1820 1960 1998 1500]
----------------------------------------
Unique values in column 'C15':
[ 2  3  4  1  5  6  7 10  8 15  9 13 12 11 14]
----------------------------------------
Unique values in column 'C16':
[214 511 407 712 206 417 609 108 510 111 517 310 509 306 513 612  17 317
 415 408 410 508 506 312 208 109 606 409 617 611 416 413 117 507 209 315
 307 211 610 212 110 217 516 313 707 215 613 314 406 116 213 112 708 216
 711 709 706 316 311 107 512 308 614 210 616 615 607 717 412 608 411 414
 806 207 514 114 106 515 115 713 810 113 710 309 808 715 714 812  14 807
  16 716 811 815  15 809 813  10 816 817  12 814 906 909  13 907 908  11]
----------------------------------------
Unique values in column 'C17':
[212 414 405 410 204 415 407 106 413 109 308 304 411  15 409 513 412 404
 310 206 107 406 115 207 313 305 209 210 108 215 311 213 114 211 110 214
 511 509 315 408 309 105 306 208 515 205 505 113 104 312 111 510 314 112
 307 514 508 512 506  14 504 507  13  12 604]
----------------------------------------
Unique values in column 'C18':
[ 16  15  17  14  18  19  20  21 110 113 111 112 114 115 116  13]
----------------------------------------
Unique values in column 'C19':
[  7  19   8  12   4  13  16  10  34  11  15   3  27  40  25   9  39  17
  30  45   5  14  24   6  26  21  29  20  22  23  18  28  43  35  36  32
  44  33 114  49  58  38  47  31  37  59 101  56  53  50  42  57  60  89
  41  75  95 190  80  51  52  61  66  46  87  48  82  55  92  94  74 192
  78 148  63  54  79  76 158  99 186  62  67 105 147 219 123  85  70 283
 125  65 127 238  90  71  69 102  84 111  73 145 118 183  68 200  64 242
  83 115  91 142  81 110  77 121  97 130 119 155 179 150 171 133 161  93
 195 167 337 236  98 132 140 100 137 128  72 175 154 178 117 222 246 134
 225 131 181  88  96 229]
----------------------------------------

In [47]:
clients[['C10', 'C11']] = clients[['C10', 'C11']].astype('float')
clients[['C3', 'C15', 'C16', 'C17', 'C18', 'C19']] = clients[['C3', 'C15', 'C16', 'C17', 'C18', 'C19']].astype('category')

In [60]:
clients.columns

Index(['ID', 'C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10',
       'C11', 'C12', 'C13', 'C14', 'C15', 'C16', 'C17', 'C18', 'C19'],
      dtype='object')

In [61]:
clients.to_csv('../data/processed/clients.csv', index=False)

#### Site Data

In [49]:
site = pd.read_csv('../data/raw/site.csv')
site.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85529 entries, 0 to 85528
Data columns (total 13 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      85529 non-null  int64
 1   S1      58668 non-null  float64
 2   S2      85529 non-null  int64
 3   S3      85529 non-null  object
 4   S4      85529 non-null  object
 5   S5      85529 non-null  object
 6   S6      58668 non-null  object
 7   S7      58668 non-null  object
 8   S8      85529 non-null  int64
 9   S9      85529 non-null  int64
 10  S10     85529 non-null  int64
 11  S11     85529 non-null  int64
 12  S12     85529 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 8.5+ MB

In [50]:
site.head(10)

,ID,S1,S2,S3,S4,S5,S6,S7,S8,S9,S10,S11,S12
0,0,1.0,0,2013-11-15,2014-02-22,2013-09-08,2013-09-07,2013-09-07,6,8,1,2,1
1,1,3.0,2,2013-11-15,2014-08-07,2013-04-18,2013-09-14,2014-03-21,11,21,4,1,1
2,2,NaN,0,2013-11-15,2013-11-05,2013-11-05,NaN,NaN,1,3,1,1,0
3,3,4.0,1,2013-11-15,2014-05-30,2013-07-03,2014-01-30,2014-05-18,10,13,4,0,5
4,4,NaN,1,2013-11-15,2013-09-22,2013-09-22,NaN,NaN,1,1,1,0,0
5,5,3.0,1,2013-11-15,2014-08-01,2013-08-23,2014-04-03,2014-05-29,6,8,0,1,1
6,6,NaN,1,2013-11-15,2014-03-16,2013-10-21,NaN,NaN,5,3,0,1,1
7,7,2.0,0,2013-11-15,2014-06-14,2014-01-24,2014-01-23,2014-06-13,6,8,6,0,1
8,8,2.0,1,2014-03-13,2014-07-02,2014-04-01,2014-03-31,2014-07-01,2,6,2,1,0
9,9,1.0,0,2013-11-15,2014-05-20,2013-09-09,2013-09-08,2013-09-08,8,10,2,2,1

In [51]:
site.isna().sum()

ID         0
S1     26861
S2         0
S3         0
S4         0
S5         0
S6     26861
S7     26861
S8         0
S9         0
S10        0
S11        0
S12        0
dtype: int64

In [52]:
site = site.drop(columns=['S6', 'S7'])

In [53]:
objects = site.select_dtypes(include=['object']).columns.to_list()
ints = site.select_dtypes(include=['int64']).columns.to_list()
floats = site.select_dtypes(include=['float64']).columns.to_list()
print("object columns are :", objects)
print("ints columns are :", ints)
print("floats columns are :", floats)

object columns are : ['S3', 'S4', 'S5']
ints columns are : ['ID', 'S2', 'S8', 'S9', 'S10', 'S11', 'S12']
floats columns are : ['S1']

In [57]:
for column in ints[1:]:
    print(f"Unique values in column '{column}':")
    print(site[column].unique())
    print("-" * 40)

Unique values in column 'S2':
[ 0  2  1  4  3  5  6 14  8  7 15 12 16 26 10  9 11 24 20 19 17 18]
----------------------------------------
Unique values in column 'S8':
[  6  11   1  10   5   2   8  14   4   3  18  12   9  22  15  52  66  27
  34  24   7  13  28  16  17  69  20  23  25  49  21  29  26  33  58  30
  36  63  75  56  19  35  39  60  37  65  38  32  73  50  47  68 135  41
  54  85  31  86  43  51  44  40 138  67  53 128  46  64  61 136  42 129
  48  55 164 163 106  59  99 170  82 125 110  57  97  96  45  72  79  98
  76  62 116  83 207 194  91 130 133  88  84  71 108 178 117  92 365  87
 111 123 115 344  89  74 204 109 161 254 112 107  81  70  80  95 104 120
 298  94 144 150 225 361 218  77  78 148 145  90 158 174 137 100 105 209
 286 101 156  93 103 139 147 142 188 102 122 272 127 172 241 124 159 196
 411 118 184 197 412 175 326 278 132 140 154 141 114 232 364 134 146 233
 316 169 162 182 191 212 221 220 173 113 119 152 167 222]
----------------------------------------
Unique values in column 'S9':
[   8   21    3   13    1    6   10   22    9    5    2   23    4   51
   32   17   16   15   25   53   49  117   87   11   12   43    7   42
   29    0   14   18   64   24   27   28   48   33   37   26  176   35
   40  126   46   44   31   58   20   86   41   19   60   30   54   56
   45   34   36   39   63  114   66   52   95   76   55   73   38  115
   85   98  100   90   83  139   47   61  245  146   50  196   65   59
   81   70   94  244   89  127   57  109   68   88  164   67   92  110
   62   84  258  106  220  151  140  325   97   91   77  130  108  137
  141   74  221  308  174  120  171  158  225  152  122  241  169  222
  198   80   69  148  102  168  365  213   78  281   82  290   71   72
  155  204  252   75  138  103   99  121  111  113   93  154  189  143
  131  167  162  134  260  104  170  271  132  446  101  105  182  125
  144  230   96  145  159  112   79  128  135  172  153  199  156  266
  273  129  147  150  311  119  251  107  133  282  323  352  142  149
  377  398  475  607  202  124  161  194  186  166  118  197  254  200
  821  216  307  175  603  362  348  224  785  615  193  310  424  116
  265  223  313  261  219  203  416  136  206  297  163  123  272  190
  214  380  165  332  215  236  231  232  201  331  401  303  280  317
  179  263  283  180  315  574  342  385  177  188  160  626  269  498
  208  212  546  633  335  286  178  205  195  237  226  217  207  250
 1059  686  185  191  192  218  397  318  485  426  304  321  390  184
  181  270  187  419  314  210  761  573  259  246  359  173  341  291
  370  183  233  253  458]
----------------------------------------
Unique values in column 'S10':
[  1   4   0   6   2   8   9  10   5   3  23  31  14   7  32  11  28  19
  13  16  18  24  12  15  17  22  26  48  21  38  45  30  20  78  39  25
  51  50  29  66  54 107  27  53  62  63  46  58  37  33  65  52 103  34
  59  67  41  47  40  69  88  44  43  42  36  60  70  56  57  91  61  35
  95 154  97  72 197  86 115 132  94 101 105  71  76  55  73  74  87 113
  49  68  81  90  80 112 182 183  64 106 125 195  99 121 286 319 164  83
 118 122  75  89  82  85 177  79 152 116 102 205 111  92 180 109]
----------------------------------------
Unique values in column 'S11':
[  2   1   0   3   7   5   4   6   9  13  11   8  16  10  12  17  20  15
  24  18  14  22  23  19  29  69  21 127  26  31  66  28  25  34  60  27
  64]
----------------------------------------
Unique values in column 'S12':
[  1   0   5   2  10   3  12   4   8  16  11   6   9  15   7  19  20  14
  22  17  13  29  25  69  24  30  18  28  23  31  21  54  38  26  36  33
  45  57  39 112  35  43  34  27]
----------------------------------------

In [58]:
site[['S8', 'S9', 'S10']] = site[['S8', 'S9', 'S10']].astype('float')
site[['S2', 'S11', 'S12']] = site[['S2', 'S11', 'S12']].astype('category')

In [59]:
for column in floats:
    print(f"Unique values in column '{column}':")
    print(site[column].unique())
    print("-" * 40)

Unique values in column 'S1':
[  1.   3.  nan   4.   2.   6.   9.  14.   8.   5.   7.  37.  25.  20.
  10.  18.  15.  11.  22.  19.  16.  31.  12.  24. 108.  43.  39.  30.
  13.  28.  27.  21.  56.  93.  51.  29.  23.  44.  47.  17.  35.  38.
  80.  42.  40.  36.  66.  26.  86.  55.  41.  48. 178.  72.  50.  52.
  68.  79.  73.  32.  34.  85.  49.  33.  46.  84. 183. 137.  53.  70.
  78.  57.  67. 151.  97.  45.  58.  98. 139. 201.  96.  63.  54. 275.
 116. 118. 100. 218.  61.  62.  92.  99. 135. 109. 177.  59. 169. 233.
  74.  87.  76.  71.  81.  82. 129. 103.  64. 113. 121. 110. 144. 162.
  91. 180.  95. 128. 149.  69.  83. 182. 157. 326. 107. 223. 120.  65.
 123.  60. 112.  94.  89. 126. 117. 148. 167. 114. 146. 106. 216. 239.
 221. 153.  75. 124. 138. 172.  90. 205.]
----------------------------------------

In [62]:
site.columns

Index(['ID', 'S1', 'S2', 'S3', 'S4', 'S5', 'S8', 'S9', 'S10', 'S11', 'S12'], dtype='object')

In [64]:
site.to_csv('../data/processed/site.csv', index=False)

#### Questions data

In [216]:
questions = pd.read_csv('../data/raw/questions.csv')
questions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85529 entries, 0 to 85528
Data columns (total 76 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      85529 non-null  int64
 1   Q1      85529 non-null  object
 2   Q2      85521 non-null  object
 3   Q3      85527 non-null  object
 4   Q4      85527 non-null  float64
 5   Q5      85529 non-null  int64
 6   Q6      27534 non-null  float64
 7   Q7      27672 non-null  object
 8   Q8      84791 non-null  float64
 9   Q9      84777 non-null  float64
 10  Q10     85528 non-null  object
 11  Q11     84751 non-null  object
 12  Q12     85015 non-null  object
 13  Q13     84507 non-null  float64
 14  Q14     83950 non-null  float64
 15  Q15     20062 non-null  float64
 16  Q16     84789 non-null  object
 17  Q17     8756 non-null   float64
 18  Q18     8507 non-null   float64
 19  Q19     85492 non-null  float64
 20  Q20     84765 non-null  float64
 21  Q21     84801 non-null  float64
 22  Q22     84765 non-null  float64
 23  Q23     84801 non-null  float64
 24  Q24     84789 non-null  float64
 25  Q25     84801 non-null  float64
 26  Q26     71969 non-null  float64
 27  Q27     84789 non-null  float64
 28  Q28     83915 non-null  object
 29  Q29     84693 non-null  object
 30  Q30     84762 non-null  float64
 31  Q31     84762 non-null  float64
 32  Q32     84670 non-null  object
 33  Q33     84760 non-null  float64
 34  Q34     85447 non-null  object
 35  Q35     64568 non-null  float64
 36  Q36     84764 non-null  object
 37  Q37     1337 non-null   float64
 38  Q38     8355 non-null   float64
 39  Q39     8355 non-null   object
 40  Q40     8355 non-null   float64
 41  Q41     84707 non-null  float64
 42  Q42     84727 non-null  float64
 43  Q43     84678 non-null  float64
 44  Q44     84838 non-null  float64
 45  Q45     84920 non-null  float64
 46  Q46     84758 non-null  float64
 47  Q47     84845 non-null  float64
 48  Q48     84764 non-null  float64
 49  Q49     84692 non-null  float64
 50  Q50     84689 non-null  float64
 51  Q51     84757 non-null  float64
 52  Q52     18225 non-null  float64
 53  Q53     85215 non-null  object
 54  Q54     54133 non-null  object
 55  Q55     54150 non-null  object
 56  Q56     54129 non-null  object
 57  Q57     54062 non-null  object
 58  Q58     84949 non-null  object
 59  Q59     84940 non-null  object
 60  Q60     84940 non-null  object
 61  Q61     84949 non-null  object
 62  Q62     85470 non-null  object
 63  Q63     84801 non-null  object
 64  Q64     84901 non-null  object
 65  Q65     84711 non-null  object
 66  Q66     84718 non-null  object
 67  Q67     84721 non-null  object
 68  Q68     84781 non-null  object
 69  Q69     84787 non-null  object
 70  Q70     84739 non-null  object
 71  Q71     84801 non-null  object
 72  Q72     84727 non-null  object
 73  Q73     51669 non-null  object
 74  Q74     51669 non-null  object
 75  Q75     51669 non-null  object
dtypes: float64(37), int64(2), object(37)
memory usage: 49.6+ MB

In [217]:
objects = questions.select_dtypes(include=['object']).columns.to_list()
ints = questions.select_dtypes(include=['int64']).columns.to_list()
floats = questions.select_dtypes(include=['float64']).columns.to_list()
print("object columns are :", objects)
print("ints columns are :", ints)
print("floats columns are :", floats)

object columns are : ['Q1', 'Q2', 'Q3', 'Q7', 'Q10', 'Q11', 'Q12', 'Q16', 'Q28', 'Q29', 'Q32', 'Q34', 'Q36', 'Q39', 'Q53', 'Q54', 'Q55', 'Q56', 'Q57', 'Q58', 'Q59', 'Q60', 'Q61', 'Q62', 'Q63', 'Q64', 'Q65', 'Q66', 'Q67', 'Q68', 'Q69', 'Q70', 'Q71', 'Q72', 'Q73', 'Q74', 'Q75']
ints columns are : ['ID', 'Q5']
floats columns are : ['Q4', 'Q6', 'Q8', 'Q9', 'Q13', 'Q14', 'Q15', 'Q17', 'Q18', 'Q19', 'Q20', 'Q21', 'Q22', 'Q23', 'Q24', 'Q25', 'Q26', 'Q27', 'Q30', 'Q31', 'Q33', 'Q35', 'Q37', 'Q38', 'Q40', 'Q41', 'Q42', 'Q43', 'Q44', 'Q45', 'Q46', 'Q47', 'Q48', 'Q49', 'Q50', 'Q51', 'Q52']

In [218]:
threshold = 10
columns_to_drop = questions.columns[(100 * questions.isna().sum() / len(questions)) > threshold]
questions = questions.drop(columns=columns_to_drop)

In [219]:
objects = questions.select_dtypes(include=['object']).columns.to_list()

In [220]:
categorical = ['Q1', 'Q2', 'Q3', 'Q10', 'Q11', 'Q12', 'Q16', 'Q28', 'Q29', 'Q32', 'Q34', 'Q36']
boolean = ['Q53', 'Q58', 'Q59', 'Q60', 'Q61', 'Q62', 'Q63', 'Q63', 'Q64', 'Q65', 'Q66', 'Q67', 'Q68', 'Q69', 'Q70', 'Q71', 'Q72']

In [221]:
threshold = 1 
for column in questions[categorical].columns:
    value_counts = (questions[column].value_counts(normalize=True) * 100)
    rare_values = value_counts[value_counts < threshold].index.tolist()
    
    if rare_values:
        print(f"Column '{column}':")
        print(f"Rare values (less than {threshold}%): {rare_values}")
        print(f"Unique values : {questions[column].unique()}")
        
        questions[column] = questions[column].replace(rare_values, "Rare")
        
        print(f"Unique values after replacing them: {questions[column].unique()}")
        print("-" * 40)

Column 'Q1':
Rare values (less than 1%): ['H7', 'HB']
Unique values : ['HA' 'HC' 'H7' 'HB']
Unique values after replacing them: ['HA' 'HC' 'Rare']
----------------------------------------
Column 'Q2':
Rare values (less than 1%): ['Z7']
Unique values : ['ZA' 'ZB' 'ZC' 'Z7' nan]
Unique values after replacing them: ['ZA' 'ZB' 'ZC' 'Rare' nan]
----------------------------------------
Column 'Q3':
Rare values (less than 1%): ['U7', 'UB']
Unique values : ['UC' 'UA' 'UB' 'U7' nan]
Unique values after replacing them: ['UC' 'UA' 'Rare' nan]
----------------------------------------
Column 'Q10':
Rare values (less than 1%): ['P7', 'PE', 'PB']
Unique values : ['PC' 'PD' 'PA' 'P7' 'PB' 'PE' nan]
Unique values after replacing them: ['PC' 'PD' 'PA' 'Rare' nan]
----------------------------------------
Column 'Q11':
Rare values (less than 1%): ['DA', 'DH', 'D5', 'DC', 'D9', 'D8', 'DP', 'DN', 'D0', 'DE', 'DT', 'D4', 'DV', 'DR']
Unique values : ['D7' 'DS' 'D3' 'DB' 'DF' 'DO' 'D1' 'DU' 'DQ' 'DA' 'DD' 'DI' 'DG' nan 'DL'
 'DT' 'DJ' 'DM' 'DC' 'DH' 'D5' 'D9' 'D0' 'DN' 'DP' 'D8' 'DV' 'D4' 'DE'
 'DR']
Unique values after replacing them: ['D7' 'DS' 'D3' 'DB' 'DF' 'DO' 'D1' 'DU' 'DQ' 'Rare' 'DD' 'DI' 'DG' nan
 'DL' 'DJ' 'DM']
----------------------------------------
Column 'Q12':
Rare values (less than 1%): ['ED', 'EM', 'EB', 'EV', 'ET', 'EC', 'ER', 'EE', 'EN', 'E3', 'E5', 'E7', 'EH', 'EQ', 'E0', 'EL', 'EO', 'EI', 'EJ', 'ES', 'EU', 'E2', 'EG', 'EF']
Unique values : ['EA' 'E8' 'E9' 'E1' 'EP' nan 'ED' 'EE' 'EM' 'EB' 'E4' 'EV' 'EN' 'ET' 'ER'
 'EC' 'E3' 'E0' 'E5' 'E7' 'EO' 'EQ' 'ES' 'EH' 'EI' 'E2' 'EG' 'EL' 'EJ'
 'EU' 'EF']
Unique values after replacing them: ['EA' 'E8' 'E9' 'E1' 'EP' nan 'Rare' 'E4']
----------------------------------------
Column 'Q16':
Rare values (less than 1%): ['False', 'true ', 'True']
Unique values : ['false' 'true' nan 'False' 'true ' 'True']
Unique values after replacing them: ['false' 'true' nan 'Rare']
----------------------------------------
Column 'Q28':
Rare values (less than 1%): ['Z9', 'ZB', 'Z7', 'ZE', 'Z5']
Unique values : ['ZA' 'ZF' 'ZD' 'Z3' 'ZC' nan 'ZB' 'Z9' 'Z7' 'Z5' 'ZE']
Unique values after replacing them: ['ZA' 'ZF' 'ZD' 'Z3' 'ZC' nan 'Rare']
----------------------------------------
Column 'Q29':
Rare values (less than 1%): ['IB', 'IE', 'I7']
Unique values : ['IA' 'ID' 'IC' nan 'I7' 'IB' 'IE']
Unique values after replacing them: ['IA' 'ID' 'IC' nan 'Rare']
----------------------------------------
Column 'Q32':
Rare values (less than 1%): ['LE', 'L7', 'LB']
Unique values : ['LC' 'LA' 'LD' nan 'L7' 'LE' 'LB']
Unique values after replacing them: ['LC' 'LA' 'LD' nan 'Rare']
----------------------------------------
Column 'Q34':
Rare values (less than 1%): ['EE', 'E9', 'EB', 'E7', 'E5']
Unique values : ['ED' 'EF' 'E3' 'EA' 'EC' 'EE' nan 'E9' 'EB' 'E7' 'E5']
Unique values after replacing them: ['ED' 'EF' 'E3' 'EA' 'EC' 'Rare' nan]
----------------------------------------
Column 'Q36':
Rare values (less than 1%): ['A7', 'AE', 'AB']
Unique values : ['AC' 'AD' 'AA' nan 'A7' 'AE' 'AB']
Unique values after replacing them: ['AC' 'AD' 'AA' nan 'Rare']
----------------------------------------

In [222]:
questions = pd.get_dummies(questions, columns=categorical, drop_first=False)

In [223]:
for column in boolean:
    print(f"Unique values in column '{column}':")
    print(questions[column].unique())
    print("-" * 40)

Unique values in column 'Q53':
['False' 'true' 'false' 'True' nan 'true ' False True]
----------------------------------------
Unique values in column 'Q58':
['false' 'true' nan 'true ']
----------------------------------------
Unique values in column 'Q59':
['false' 'true' nan 'true ']
----------------------------------------
Unique values in column 'Q60':
['false' 'true' nan 'False' 'true ' 'True' False True]
----------------------------------------
Unique values in column 'Q61':
['false' 'true' nan 'true ']
----------------------------------------
Unique values in column 'Q62':
['false' 'true' 'true ' nan]
----------------------------------------
Unique values in column 'Q63':
['false' 'False' 'true' nan 'True' 'true ' False True]
----------------------------------------
Unique values in column 'Q63':
['false' 'False' 'true' nan 'True' 'true ' False True]
----------------------------------------
Unique values in column 'Q64':
['false' 'true' nan 'true ']
----------------------------------------
Unique values in column 'Q65':
['false' 'true' nan 'true ']
----------------------------------------
Unique values in column 'Q66':
['true' 'false' nan 'true ']
----------------------------------------
Unique values in column 'Q67':
['false' 'true' nan 'true ']
----------------------------------------
Unique values in column 'Q68':
['true' 'false' nan 'true ']
----------------------------------------
Unique values in column 'Q69':
['false' 'true' nan 'true ']
----------------------------------------
Unique values in column 'Q70':
['true' 'false' nan 'true ']
----------------------------------------
Unique values in column 'Q71':
['false' 'true' nan 'False' 'true ' 'True']
----------------------------------------
Unique values in column 'Q72':
['false' 'true' nan 'true ']
----------------------------------------

In [224]:
mapping = {'true': True, 'false': False}
for column in boolean:
    questions[column] = questions[column].fillna('unknown').astype(str).str.strip().str.lower().map(mapping)

In [225]:
label_encoder = LabelEncoder()
for col in boolean:
    questions[col] = label_encoder.fit_transform(questions[col])

In [226]:
questions[boolean].head(10)

,Q53,Q58,Q59,Q60,Q61,Q62,Q63,Q63,Q64,Q65,Q66,Q67,Q68,Q69,Q70,Q71,Q72
0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,0,0
1,1,1,1,0,1,0,0,0,0,0,0,0,1,0,1,0,0
2,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0
3,0,0,0,0,0,1,0,0,0,1,0,0,1,0,1,0,0
4,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,0,0
5,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0
6,0,0,0,0,1,0,0,0,0,0,0,0,1,0,1,0,0
7,0,0,0,0,0,0,0,0,0,0,0,1,1,0,1,0,0
8,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0
9,0,0,0,0,0,0,0,0,1,0,1,0,1,0,1,0,0

In [227]:
floats = questions.select_dtypes(include=['float64']).columns.to_list()
print("floats columns are :", floats)

for column in floats:
    print(f"Unique values in column '{column}':")
    print(questions[column].unique())
    print("-" * 40)

floats columns are : ['Q4', 'Q8', 'Q9', 'Q13', 'Q14', 'Q19', 'Q20', 'Q21', 'Q22', 'Q23', 'Q24', 'Q25', 'Q27', 'Q30', 'Q31', 'Q33', 'Q41', 'Q42', 'Q43', 'Q44', 'Q45', 'Q46', 'Q47', 'Q48', 'Q49', 'Q50', 'Q51']
Unique values in column 'Q4':
[8.000e+00 1.660e+02 1.700e+01 1.600e+01 2.300e+01 1.120e+02 1.400e+01
 6.600e+01 1.000e+01 2.400e+01 3.000e+01 7.600e+01 4.200e+01 5.200e+01
 3.300e+01 3.800e+01 1.280e+02 2.200e+01 1.300e+01 1.800e+01 1.160e+02
 3.900e+01 5.000e+00 3.700e+01 4.100e+01 7.000e+00 9.300e+01 9.600e+01
 1.760e+02 3.100e+01 1.200e+01 2.800e+01 4.600e+01 2.500e+01 2.000e+00
 3.400e+01 3.000e+00 1.100e+01 6.000e+00 4.000e+00 1.000e+00 3.600e+01
 5.600e+01 6.400e+01 8.600e+01 9.000e+00 1.040e+02 2.160e+02 1.010e+02
 4.000e+01 2.600e+01 3.200e+01 3.500e+01 2.900e+01 4.300e+01 1.150e+02
 5.100e+01 1.500e+01 1.900e+01 7.900e+01 2.100e+01 4.800e+01 2.700e+01
 1.090e+02 2.000e+01 3.160e+02 2.360e+02 9.700e+01 4.400e+01 1.060e+02
 2.500e+02 9.500e+01 5.300e+01 6.900e+01 4.500e+01 4.700e+01 4.900e+01
 1.260e+02 6.300e+01 7.300e+01 6.100e+01 8.700e+01 6.200e+01 8.100e+01
 6.500e+01 5.400e+01 6.800e+01 2.060e+02 5.700e+01 8.300e+01 1.400e+02
 8.000e+01 1.470e+02 0.000e+00 1.100e+02 1.460e+02 1.370e+02 1.670e+02
 8.800e+01 9.400e+01 5.000e+01 2.610e+02 5.900e+01 1.960e+02 7.800e+01
 6.000e+01 1.110e+02 5.160e+02 1.860e+02 7.100e+01 2.310e+02 1.360e+02
 2.270e+02 1.200e+02 9.100e+01 1.560e+02 1.900e+02 5.800e+01 1.930e+02
 6.160e+02 6.700e+01 7.060e+02 2.320e+02 1.310e+02 4.010e+02 7.500e+01
 1.050e+02 1.340e+02 1.680e+02 2.290e+02 7.400e+01 3.280e+02 1.020e+02
 2.620e+02 2.660e+02 1.490e+02 1.320e+02 8.400e+01 1.250e+02 1.640e+02
 2.220e+02 2.430e+02 4.160e+02 2.010e+02 1.140e+02 5.500e+01 8.200e+01
 1.220e+02 1.600e+02 1.440e+02 1.390e+02 1.000e+02 2.040e+02 1.910e+02
 1.510e+02 1.380e+02 7.160e+02 8.500e+01 1.430e+02 2.240e+02 7.110e+02
 2.560e+02 2.260e+02 1.210e+02 1.700e+02 1.450e+02 1.180e+02 1.170e+02
 2.640e+02 2.200e+02 1.800e+02 8.060e+02 1.330e+02 1.290e+02 1.890e+02
 2.880e+02 9.000e+01 8.900e+01 1.130e+02 7.700e+01 9.200e+01 1.410e+02
 4.660e+02 1.710e+02 1.620e+02 1.230e+02 1.270e+02 7.000e+01 2.000e+02
 1.070e+02 7.050e+02 3.660e+02 1.740e+02 1.300e+02 1.080e+02 1.350e+02
 1.970e+02 1.810e+02 9.800e+01 3.030e+02 2.110e+02 2.410e+02 1.030e+02
 2.150e+02 1.610e+02 2.180e+02 1.420e+02 1.190e+02 1.840e+02 2.250e+02
 7.200e+01 1.630e+02 3.040e+02 1.004e+03 1.690e+02       nan 1.500e+02
 1.240e+02 1.780e+02 4.960e+02 8.160e+02 2.810e+02 2.140e+02 2.330e+02
 4.740e+02 1.590e+02 2.800e+02 1.530e+02 1.570e+02 2.050e+02 2.300e+02
 1.550e+02 2.570e+02 2.460e+02 2.340e+02 1.540e+02 3.980e+02 3.890e+02
 2.390e+02 4.070e+02 1.480e+02 3.820e+02 4.500e+02 1.990e+02 2.860e+02
 3.310e+02 2.020e+02 1.950e+02 2.380e+02 1.750e+02 9.900e+01 2.840e+02
 2.070e+02 3.960e+02 2.210e+02 3.560e+02 2.100e+02 1.920e+02 2.550e+02
 1.880e+02 1.820e+02 2.510e+02 2.760e+02 3.760e+02 2.650e+02 1.940e+02
 5.660e+02 3.270e+02 2.920e+02 2.680e+02 1.520e+02 1.720e+02 9.160e+02
 3.320e+02 2.960e+02 4.360e+02 2.230e+02 2.170e+02 1.650e+02 4.990e+02
 2.630e+02 3.740e+02 3.240e+02 1.980e+02 2.830e+02 3.060e+02 2.530e+02
 3.000e+02 3.260e+02 4.340e+02 3.450e+02 4.460e+02 3.170e+02 3.710e+02
 2.480e+02 1.790e+02 4.510e+02 3.360e+02 3.200e+02 1.016e+03 1.830e+02
 2.030e+02 5.180e+02 3.080e+02 3.370e+02 1.730e+02 3.680e+02 4.000e+02
 5.200e+02 2.350e+02 2.440e+02 2.470e+02 2.690e+02 3.330e+02 3.510e+02
 3.910e+02 4.560e+02 2.870e+02 4.050e+02]
----------------------------------------
Unique values in column 'Q8':
[ 2.  0.  4. nan  1.  3.  5.]
----------------------------------------
Unique values in column 'Q9':
[25.   23.5  22.   23.3  23.   24.   25.5  28.   31.   30.   26.   27.
 40.   18.   50.   28.5    nan 32.5  27.5  20.   24.5  35.   60.   28.3
 26.9  26.5  23.8  29.   29.5  37.5  21.   32.7  32.   33.   24.3  24.8
 24.6  15.   25.6  25.7  25.2  29.8  24.7  24.2  45.   25.4  27.3  24.9
 25.3  38.   27.4  26.7  26.2  26.8  42.   25.9  22.5  34.   39.   23.6
 23.9  22.4  36.   27.7  29.7  55.   18.5  56.   21.5  24.1  28.7  42.5
 26.4  19.   20.5  27.8  35.4  28.6  23.7  24.4  41.   37.   31.7  26.6
 29.3  25.8  28.4  23.4  31.5  48.   22.8  22.2  18.9  30.5  26.3  46.
 29.2  22.6  34.5  27.2  25.1  34.6  17.   33.5  30.6  21.7  24.35 28.2
 43.   26.1  26.25 22.7  27.1  23.2  28.9  27.6  32.4  26.56 35.3  30.8
 31.2  29.03 27.9  22.9  16.5  21.4  20.3  52.   44.   30.2  35.8  47.8
 18.6  47.   28.8  49.   19.5  29.4  24.87 58.   25.75 30.3  32.9 ]
----------------------------------------
Unique values in column 'Q13':
[ 936.  930.  915.  900.  955.   nan  880.  888.  928.  947.  950.  850.
  935.  830.  976.  840.  920.  800.  720.  986.  890.  868.  886.  910.
  829.  967.  914.  959.  855.  820.  925.  952.  899.  958.  956.  941.
  895.  870.  965.  876.  960.  913.  650.  918.  968.  978.  860.  934.
  940.  946.  932.  879.  937.  951.  742.  799.  945.  904.  875.  770.
  943.  882.  953.  926.  963.  835.  861.  891.  898.  927.  917.  905.
  957.  780.  906.  912.  938.  841.  916.  778.  948.  929.  944.  865.
  922.  966.  982.  823.  885.  933.  896.  974.  810.  919.  970.  867.
  972.  964.  942.  902.  892.  939.  923.  961.  975.  969.  790.  981.
  760.  866.  750.  884.  924.  873.  901.  973.  828.  822.  837.  949.
  893.  825.  911.  883.  921.  977.  897.  887.  864.  983.  980.  962.
  844.  894.  836.  881.  908.  839.  831.  877.  931.  843.  846.  954.
  680.  907.  909.  851.  971.  852.  889.  979.  761.  775.  878.  869.
  874.  985.  765.  853.  795.  857.  847.  903.  815.  700.  863.  871.
  794.  842.  766.  797.  550.  771.  859.  989.  845.  834.  400.  826.
  808.  990.  821.  811.  838.  984.  988.  872.  785.  643.  805.  862.
  600.  832.  740.  802.  856.  812.  833.  858.  849.  730.  854.  987.
  791.  450.  806.  782.  783.  772.  817.  792. 1000.  640.  776.  814.
  781.  809.  818.  736.  848.  751.  816.  813.  575.  744.  743.  801.
  710.  804.  759.  777.  762.  788.  798.  725.  701.  715.  570.  712.
  695.  827.  670.  753.  716.  824.  615.  796.  727.  819.  755.  807.
  768.  632.  774.  732.  803.  620.  500.  688.  675.  705.  630.  580.
  460.  763.  757.   15.  767.  779.  685.  544.  786.  728.  752.  478.
  784.  551.  717.  746.  745.  787.   25.  660.  758.  735.  726.  415.
    0.  764.  711.  769.  709.  677.  991.  773.  635.  565.  480.  756.
  754.  793.  748.  590.  704.  789.  733.  722.  625.  713.  690.  585.
  729.  510.  997.  747.  993.  741.  471.  610.  648.  721.  420.  150.
  718.]
----------------------------------------
Unique values in column 'Q14':
[240. 180.  nan 170. 222. 200. 230. 231. 100. 198. 232. 234. 190. 239.
 195. 237. 140. 225. 228. 210. 229. 215. 220. 205. 235. 212. 165. 204.
 201. 236. 233. 160. 224. 218. 192. 120. 238.  65. 150. 155. 185. 175.
 194. 214. 164. 219.  90. 217. 208. 172. 207. 193. 216. 206. 197. 213.
 202. 186. 223. 187. 182. 227. 191. 110. 203. 178. 221. 166. 196.  40.
 179. 184. 189. 176. 154. 171. 168. 130. 209. 226. 143. 105. 115. 128.
 183. 135. 161. 199. 114.   0. 181. 188. 177. 173. 141. 126. 145. 211.
 163.  60. 169. 159. 174. 167. 129. 139. 152. 124. 151. 131. 270. 156.
 142. 121. 125. 162. 158. 104. 148. 133.  10. 265. 144. 122. 149. 157.]
----------------------------------------
Unique values in column 'Q19':
[ 2.  3.  4.  1.  5.  6.  7. 10.  8. nan 15.  9. 13. 12. 11. 14.]
----------------------------------------
Unique values in column 'Q20':
[10.  12.   6.   9.  11.   8.   8.5 20.  13.  15.   nan  5.   7.  10.5
  9.5  4.  12.5 11.5 14.   7.5  9.3 10.6 16.   1.  10.7 17.   5.5  9.6
  3.  10.4  9.2  2.  10.2 18.  13.5  0.   9.8  8.7 19.   8.6  7.6  6.5
  6.6 11.2 10.9  5.3 11.6  8.3  9.7  9.4 11.4 10.3  8.2  8.8]
----------------------------------------
Unique values in column 'Q21':
[ 1.  0. nan  2.]
----------------------------------------
Unique values in column 'Q22':
[10.   14.   12.   11.    8.   13.    9.    8.5  18.   10.5  15.     nan
 20.    7.   11.5  17.   12.5  16.    9.5   6.   13.4   5.    7.5  14.5
 13.5   0.    5.5   9.6   1.   11.4  10.2   4.   10.4   3.    9.8  10.7
  2.    8.6   6.5  10.9   9.2   8.3   9.4   8.8  11.6  11.2  10.82  8.2
 19.   10.3 ]
----------------------------------------
Unique values in column 'Q23':
[ 1.  0. nan  2.]
----------------------------------------
Unique values in column 'Q24':
[ 0.  1. nan  2.]
----------------------------------------
Unique values in column 'Q25':
[ 1.  0. nan  2.]
----------------------------------------
Unique values in column 'Q27':
[ 0.  1. nan  2.]
----------------------------------------
Unique values in column 'Q30':
[ 2.  0.  1.  7.  6. 15.  3.  5.  4. nan 16. 23. 24. 26. 21. 20. 12. 10.
  8. 14. 19. 18. 22. 25. 13. 11.  9. 17.]
----------------------------------------
Unique values in column 'Q31':
[ 3.  0.  2.  1.  6.  4. 15.  5. nan 16. 23. 26.  8. 10.  7. 12. 18. 20.
 11. 24.  9. 21. 25. 14. 13. 22. 19. 17.]
----------------------------------------
Unique values in column 'Q33':
[ 0.  3.  2.  1.  4.  7. nan  5. 10.  9.  8.  6. 21.]
----------------------------------------
Unique values in column 'Q41':
[ 0.  1.  2. nan  3.]
----------------------------------------
Unique values in column 'Q42':
[ 1.  0.  2. nan  3.]
----------------------------------------
Unique values in column 'Q43':
[ 0.  1. nan  2.  3.]
----------------------------------------
Unique values in column 'Q44':
[ 0.  1.  3.  2. nan  4.]
----------------------------------------
Unique values in column 'Q45':
[ 1.  0. nan  2.  3.  4.]
----------------------------------------
Unique values in column 'Q46':
[ 1.  0. nan  2.  3.]
----------------------------------------
Unique values in column 'Q47':
[ 0.  1. nan  2.  3.]
----------------------------------------
Unique values in column 'Q48':
[ 2.  0.  1.  3.  5.  4.  6. nan  8. 10.  7.  9.]
----------------------------------------
Unique values in column 'Q49':
[ 1.  2.  3.  0. nan]
----------------------------------------
Unique values in column 'Q50':
[ 1.  2.  3.  0. nan]
----------------------------------------
Unique values in column 'Q51':
[ 1.  0.  3.  2.  5.  4. nan 10. 15.  9. 20.  6.  7.]
----------------------------------------

In [228]:
to_one_hot = ['Q8', 'Q21', 'Q23', 'Q24', 'Q25', 'Q27', 'Q41' ,'Q42', 'Q43', 'Q44', 'Q45', 'Q46', 'Q47', 'Q49', 'Q50']
to_int = ['Q19', 'Q31', 'Q48']

In [229]:
most_common_values = questions[to_int].mode().iloc[0].to_dict()
questions[to_int] = questions[to_int].apply(lambda x: x.fillna(most_common_values[x.name]))
questions[to_int] = questions[to_int].astype('int64')

In [230]:
threshold = 1 
for column in questions[to_one_hot].columns:
    value_counts = (questions[column].value_counts(normalize=True) * 100)
    rare_values = value_counts[value_counts < threshold].index.tolist()
    
    if rare_values:
        print(f"Column '{column}':")
        print(f"Rare values (less than {threshold}%): {rare_values}")
        print(f"Unique values : {questions[column].unique()}")
        
        questions[column] = questions[column].replace(rare_values, "Rare")
        
        print(f"Unique values after replacing them: {questions[column].unique()}")
        print("-" * 40)

Column 'Q8':
Rare values (less than 1%): [3.0, 1.0, 5.0]
Unique values : [ 2.  0.  4. nan  1.  3.  5.]
Unique values after replacing them: [2.0 0.0 4.0 nan 'Rare']
----------------------------------------
Column 'Q21':
Rare values (less than 1%): [2.0]
Unique values : [ 1.  0. nan  2.]
Unique values after replacing them: [1.0 0.0 nan 'Rare']
----------------------------------------
Column 'Q23':
Rare values (less than 1%): [2.0]
Unique values : [ 1.  0. nan  2.]
Unique values after replacing them: [1.0 0.0 nan 'Rare']
----------------------------------------
Column 'Q24':
Rare values (less than 1%): [2.0]
Unique values : [ 0.  1. nan  2.]
Unique values after replacing them: [0.0 1.0 nan 'Rare']
----------------------------------------
Column 'Q25':
Rare values (less than 1%): [2.0]
Unique values : [ 1.  0. nan  2.]
Unique values after replacing them: [1.0 0.0 nan 'Rare']
----------------------------------------
Column 'Q27':
Rare values (less than 1%): [2.0]
Unique values : [ 0.  1. nan  2.]
Unique values after replacing them: [0.0 1.0 nan 'Rare']
----------------------------------------
Column 'Q41':
Rare values (less than 1%): [3.0]
Unique values : [ 0.  1.  2. nan  3.]
Unique values after replacing them: [0.0 1.0 2.0 nan 'Rare']
----------------------------------------
Column 'Q42':
Rare values (less than 1%): [3.0]
Unique values : [ 1.  0.  2. nan  3.]
Unique values after replacing them: [1.0 0.0 2.0 nan 'Rare']
----------------------------------------
Column 'Q43':
Rare values (less than 1%): [2.0, 3.0]
Unique values : [ 0.  1. nan  2.  3.]
Unique values after replacing them: [0.0 1.0 nan 'Rare']
----------------------------------------
Column 'Q44':
Rare values (less than 1%): [3.0, 4.0]
Unique values : [ 0.  1.  3.  2. nan  4.]
Unique values after replacing them: [0.0 1.0 'Rare' 2.0 nan]
----------------------------------------
Column 'Q45':
Rare values (less than 1%): [2.0, 3.0, 4.0]
Unique values : [ 1.  0. nan  2.  3.  4.]
Unique values after replacing them: [1.0 0.0 nan 'Rare']
----------------------------------------
Column 'Q46':
Rare values (less than 1%): [3.0]
Unique values : [ 1.  0. nan  2.  3.]
Unique values after replacing them: [1.0 0.0 nan 2.0 'Rare']
----------------------------------------
Column 'Q47':
Rare values (less than 1%): [2.0, 3.0]
Unique values : [ 0.  1. nan  2.  3.]
Unique values after replacing them: [0.0 1.0 nan 'Rare']
----------------------------------------

In [231]:
questions = pd.get_dummies(questions, columns=to_one_hot, drop_first=True)

In [232]:
booleans = questions.select_dtypes(include=['bool']).columns.to_list()
int_32 = questions.select_dtypes(include=['int32']).columns.to_list()
questions[booleans] = questions[booleans].astype('int64')
questions[int_32] = questions[int_32].astype('int64')

In [233]:
questions.to_csv('../data/processed/questions.csv', index=False)